-- tap --
tap "caskroom/cask"
tap "d12frosted/emacs-plus"
tap "elastic/tap"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services", "https://gitee.com/cunkai/homebrew-services.git"
tap "laishulu/macism"
tap "railwaycat/emacsmacport"
tap "shivammathur/php"
tap "timothyye/tap"
tap "universal-ctags/universal-ctags"

-- brew --
brew "readline"
brew "sqlite"
brew "aircrack-ng"
brew "jpeg-xl"
brew "aom"
brew "aspell"
brew "autoconf"
brew "python@3.10", link: false
brew "autojump"
brew "automake"
brew "bandwhich"
brew "bat"
brew "bear"
brew "bottom"
brew "zstd"
brew "gcc"
brew "btop"
brew "freetype"
brew "glib"
brew "libffi"
brew "pkg-config"
brew "python@3.9"
brew "coreutils"
brew "libtool"
brew "guile"
brew "unbound"
brew "gnutls"
brew "cask"
brew "ccache"
brew "llvm"
brew "ccls"
brew "tbb"
brew "clang-format"
brew "cloc"
brew "rlwrap"
brew "clojure"
brew "cmake"
brew "libavif"
brew "krb5"
brew "composer"
brew "connect"
brew "corkscrew"
brew "cppcheck"
brew "ctags", link: false
brew "ctop"
brew "deno"
brew "direnv"
brew "doxygen"
brew "editorconfig"
brew "exa"
brew "fasd"
brew "fd"
brew "gobject-introspection"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fish"
brew "pango"
brew "fontforge"
brew "fop"
brew "gdk-pixbuf"
brew "gh"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "universal-ctags"
brew "global"
brew "glow"
brew "gnu-tar"
brew "libksba"
brew "gnupg"
brew "qt@5"
brew "gnuplot"
brew "google-java-format"
brew "libgphoto2"
brew "gphoto2"
brew "graphene"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "grex"
brew "gstreamer"
brew "gst-plugins-base"
brew "htop"
brew "hub"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "languagetool"
brew "lazygit"
brew "leiningen"
brew "libpcap"
brew "libxml2"
brew "libxslt"
brew "llvm@12"
brew "mercurial"
brew "mplayer"
brew "mycli"
brew "mysql@5.7", restart_service: true
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "numpy", link: false
brew "nvm"
brew "pyqt@5"
brew "vtk"
brew "opencv"
brew "pandoc"
brew "peco"
brew "poppler"
brew "postgresql@14"
brew "qemu"
brew "qt", link: false
brew "rabbitmq"
brew "ranger"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "sdcv"
brew "sdl2_image"
brew "sdl2_ttf"
brew "shellcheck"
brew "smartmontools"
brew "subversion"
brew "tcl-tk"
brew "tealdeer"
brew "tectonic"
brew "texinfo"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "vim"
brew "wget"
brew "winetricks"
brew "zlib"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@27", link: false
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-spacemacs-icon"], link: false
brew "elastic/tap/elasticsearch-full"
brew "elastic/tap/kibana-full"
brew "elastic/tap/logstash-full"
brew "laishulu/macism/macism"
brew "shivammathur/php/php@7.1"
brew "timothyye/tap/skm"
brew "timothyye/tap/ydict"

-- cask --
cask "android-platform-tools"
cask "apparency"
cask "emacs"
cask "fig"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-juliamono"
cask "font-source-code-pro"
cask "julia"
cask "karabiner-elements"
cask "keycastr"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "qt-creator"
cask "quicklook-json"
cask "quicklookapk"
cask "quicklookase"
cask "suspicious-package"
cask "webpquicklook"
cask "wine-crossover"
cask "xquartz"
